#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=49abbc39-57ae-4147-ab57-4b34c5c9efad]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=aeef11d5-97d0-4f86-996e-47af535796a8]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7bf4efe9-0624-496b-9d8c-e38d59476a9b]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d60fed94-d59d-4356-8e8f-0227b6093d86]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6f20e6c8-e6c4-43f9-a7c6-9d15ccc6788a]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b9b17d88-d20f-4e94-9cc6-11ccbec9f836]
module.keycloak_prod.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0796b64e-fd7d-45a8-a1dd-2791d9e9b0e5]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5258abeb-ce1b-4e0f-8734-7f291616c453]
module.keycloak_prod.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0e224d2a-c201-4cee-8556-ed4228286ded]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9bf15728-3e4b-40ab-8983-44c8c61be0aa]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=37f2dcfa-29e0-41fc-bc6e-0b7743a949a7]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e98ba833-e8a8-423d-b34d-0748fa595d7d]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c257419a-9122-41ad-8924-a5f5de257fee]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=aeb2982e-7a95-40ce-9b35-71f53df99017]
module.keycloak_prod.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4017f6ff-e147-49a4-bc79-a24c8fb84871]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=adda8927-9684-4af1-ad5b-6ae29e01fb04]
module.keycloak_prod.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5db6f285-c553-40f6-8af1-de9ce6f104fe]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3686f5f7-51dc-4d9e-a109-2e39d03e34a6]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=684a5343-9bdf-4389-9893-5d813007aeb5]
module.keycloak_prod.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9760b1ca-7f75-457a-86a0-c4a1fbd2c6db]
module.keycloak_prod.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2bb672a0-21f7-41e5-9434-cb15a596ceb1]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=50689c5e-4522-4583-b399-ea5f063c1268]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7b6d9876-f1df-4c5f-89a2-8735ceb8a2c9]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3a996ce2-2356-4646-bbe2-48420ae30757]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1119d605-e98d-4934-9e6c-0bb9e02a2723]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=06135703-8103-4b4c-bd71-30b6db4d2cb9]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8d7ca044-250a-4e56-8c70-5ff471801fa6]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa926bed-ab93-417a-8fd0-2a70bbb012c2]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=652bb5b2-e99b-4c9f-b764-6b3c5092233d]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=63b2d963-e96e-4b2c-bfbb-b6809a23e09d]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a0767afc-98cf-4aef-ae83-eeae5d1f5cc3]
module.keycloak_prod.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bd6c6813-22c4-4809-8cd9-e1262011e59d]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=362d976c-2820-4f0f-a373-c520c3478342]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2ba29669-a2be-43c4-9e73-13c9b066ff39]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6a7af59a-11e1-428c-b95b-a003240adc81]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=583832ff-31c6-44cc-ac45-92a613fbf55b]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=583ff0c9-2c2e-4ab8-bd30-0478b5bfda23]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=80124ac5-0cfb-4bdc-bb8c-bb064be97d64]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bcee6b9e-fc99-436e-943e-69858a9502cd]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7c13561-3d76-4df9-8cde-4818654a47fa]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3989dbda-821a-4bd9-9ce8-0fe9bfce0a46]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=72dde44e-3848-4f19-a129-0f0b1ceddcc3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aad1dca1-d021-4d82-9f4f-4684f0699ba8]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b5fb3bbb-d6a6-4465-a82d-efee377517b0]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=215df007-f631-4bdd-b1e8-0cb1d73dfa9e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7296cd65-0e8c-41ca-a4d4-f7948825fb67]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=21536bfa-a1b1-4d4d-9575-83e810737150]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ce688764-8c6d-470b-8111-1af53a8ec4cb]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=984127b9-dced-4b84-8652-c7bb8cd24215]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bdbd7f75-6dd0-460d-b149-eced1bff3fdf]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b043252c-74ed-4d3c-86d5-4b336e3567da]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4be522e8-1b42-43fa-8760-47f39d75a453]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f5469356-f387-45fc-8400-19b035bfedda]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a1c1da09-548f-4670-a818-30ff42436f01]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=06b673dc-bd94-42f7-87b1-b81755ed8543]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=65c5629d-1fd4-466e-b370-f1eb66779591]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=df35cbac-a262-4a69-94eb-3bf5dfdfa678]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=076d6724-e534-4ddd-a5cd-984a2593660a]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=65874df5-8751-49f2-abc2-e261d86f6cb5]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7aa014f9-a491-4038-a3ed-154a66d9b65e]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=aed6817d-a2e4-43fa-9207-620f8eca100f]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5c0c6f1f-1069-4f41-8169-2df2caea0c5f]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2de6e97a-d3af-4fd8-af46-25da1f1e0adb]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7a018ed9-f0bb-4a3a-8de3-d3a9c3831485]
module.keycloak_prod.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=124ff7ca-fcf5-467f-b768-1618d55145b1]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6be1ff59-fbb1-413c-8ba7-0dc82d0a8f09]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d93bee8-51bc-4628-9bd6-28c86223b758]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=433c6050-f9af-4d52-9d8d-d4cc22370459]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a71a96c9-512b-4ffe-998b-4118884e2afd]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3d52de61-504c-4dad-9040-9b18488d3a83]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=532e882f-23e3-4b1f-b623-87da219e84a5]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a5b7488-e47c-40cc-9270-3a7cb6c98740]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=17c09713-1067-439c-8d76-eda0a92b4cbb]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=92eb1cbb-06ee-4202-b84d-271911fd135f]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=34fe8125-8207-4620-b672-6349c58fce3f]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=accb4620-9139-4614-adcf-c6cee0a5cee6]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5f82c756-9443-48a7-9501-cb6eb0eb2ac3]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccebffe8-4187-478b-92ae-2632a8966fb9]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0fe9e1ce-b106-4b12-ba6c-284f60baf198]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dc0e2750-aad7-4a56-af72-ec14d64b9835]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c4b405e-48c4-424e-ad46-c05ddf8187c6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "asdfasfdasdf-3"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "asdfasfdasdf-3"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asdfasfdasdf-3.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "asdfasfdasdf-3"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdfasfdasdf-3"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*